In [68]:
import pandas as pd
import numpy as np
data = pd.read_csv('data/adult.data.csv')
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [9]:
#1.Сколько мужчин и женщин (признак sex) представлено в этом наборе данных?
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [29]:
#2.  Каков средний возраст (признак age) женщин?
data[data['sex'] == 'Female']['age'].mean()

36.85823043357163

In [67]:
#3. Какова доля граждан Германии (признак native-country)?

a = len(data[data['native-country'] == 'Germany'])
b = len(data)
c = a/b*100
print(c)

0.42074874850281013

In [70]:
#4-5. Каковы средние значения и среднеквадратичные отклонения возраста тех, кто 
#получает более 50K в год (признак salary) и тех, кто получает менее 50K в год?

data.groupby(['salary'])['age'].agg([np.std, np.mean])

              std       mean
salary
<=50K   14.020088  36.783738
>50K    10.519028  44.249841

In [105]:
#6. Правда ли, что люди, которые получают больше 50k, имеют как минимум высшее образование? 
#(признак education равен Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters или Doctorate)
col_to_show = ['Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate']

sal = pd.crosstab(data['salary'], data['education'], margins=True)

s = sal.groupby(['salary'])[col_to_show].sum()
s['sum']= s.sum(axis=1)
s.head()

education,Bachelors,Prof-school,Assoc-acdm,Assoc-voc,Masters,Doctorate,sum
salary,,,,,,,
<=50K,3134,153,802,1021,764,107,5981
>50K,2221,423,265,361,959,306,4535
All,5355,576,1067,1382,1723,413,10516

In [106]:
#7. Каков максимальный возраст мужчин расы Amer-Indian-Eskimo? 
data[data['race'] == 'Amer-Indian-Eskimo']['age'].max()

82

In [130]:
#8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или 
#холостых мужчин (признак marital-status для женатых равен Married-civ-spouse,
# Married-spouse-absent или Married-AF-spouse)?

marital = pd.crosstab(data['salary'], data['marital-status'])
marital

marital-status,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed
salary,,,,,,,
<=50K,3980,13,8284,384,10192,959,908
>50K,463,10,6692,34,491,66,85

In [146]:
all_married = marital['Married-AF-spouse']+marital['Married-civ-spouse']+marital['Married-spouse-absent']
#marital.insert(loc = len(marital.columns), column = 'All married', value = all_married)

In [139]:
not_married = marital['Divorced'] + marital['Never-married'] + marital['Separated'] + marital['Widowed']
#marital.insert(loc = len(marital.columns), column = 'Not married', value = not_married)
marital

marital-status,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,All married,Not married
salary,,,,,,,,,
<=50K,3980,13,8284,384,10192,959,908,8681,16039
>50K,463,10,6692,34,491,66,85,6736,1105

In [143]:
#marital.insert(loc = len(marital.columns), column = "% married", value = (marital['All married'] / len(data)))

In [145]:
#marital.insert(loc = len(marital.columns), column = "% not married", value = (marital['Not married'] / len(data)))
marital

marital-status,Divorced,Married-AF-spouse,Married-civ-spouse,Married-spouse-absent,Never-married,Separated,Widowed,All married,Not married,% married,% not married
salary,,,,,,,,,,,
<=50K,3980,13,8284,384,10192,959,908,8681,16039,0.266607,0.492583
>50K,463,10,6692,34,491,66,85,6736,1105,0.206873,0.033936

In [182]:
#9. Какое максимальное число часов человек работает в неделю (признак 
#hours-per-week)? Сколько людей работают такое количество часов и каков среди 
#них процент зарабатывающих много? 

max_h = data['hours-per-week'].max()
print(max_h)
amount = len(data[data['hours-per-week'] == 99])
print(amount)
percent = len(data[(data['hours-per-week'] == 99) & (data['salary'] == '>50K')]) / amount * 100
print(percent)

99
85
29.411764705882355

In [208]:
#10. Каково среднее время работы (hours-per-week) зарабатывающих мало и много
#(salary) для Японии?

#data.groupby(['native-country', 'salary'])['hours-per-week'].agg([np.mean])

rich = data[(data['native-country']=='Japan') & (data['salary']=='>50K')]['hours-per-week'].mean()
poor = data[(data['native-country']=='Japan') & (data['salary']=='<=50K')]['hours-per-week'].mean()
print (rich, poor)

#jap = pd.crosstab(data['native-country'])

47.958333333333336 41.0